FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
/****************************************************************************
 * boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <inttypes.h>
#include <stddef.h>
#include <stdint.h>
#include <sys/param.h>
#include <syslog.h>

#include <arch/board/board.h>
#include <arch/stm32n6/chip.h>
#include <debug.h>
#include <nuttx/arch.h>
#include <nuttx/cache.h>
#include <nuttx/compiler.h>

#include "arm_internal.h"

#include "hardware/stm32n6_gpio.h"
#include "hardware/stm32n6_memorymap.h"
#include "hardware/stm32n6_rcc.h"
#include "hardware/stm32n6_xspi.h"

#include "stm32n6_xspi.h"
#include "stm32n6570-dk.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define STM32N6570_XSPI_200MHZ           200000000u
#define STM32N6570_XSPI_50MHZ            50000000u
#define STM32N6570_XSPI_PSRAM_MAPPED_HZ  STM32N6570_XSPI_200MHZ
#define STM32N6570_XSPI_NOR_RESET_DELAY_MS 100u
#define STM32N6570_XSPI_STATUS_TIMEOUT   1000000u

#define MX66UW1G45G_RESET_ENABLE_CMD     0x66u
#define MX66UW1G45G_RESET_MEMORY_CMD     0x99u
#define MX66UW1G45G_OCTA_RESET_ENABLE_CMD 0x6699u
#define MX66UW1G45G_OCTA_RESET_MEMORY_CMD 0x9966u
#define MX66UW1G45G_READ_ID_CMD          0x9fu
#define MX66UW1G45G_READ_STATUS_CMD      0x05u
#define MX66UW1G45G_WRITE_ENABLE_CMD     0x06u
#define MX66UW1G45G_CFG2_WRITE_CMD       0x72u
#define MX66UW1G45G_CFG2_READ_CMD        0x71u
#define MX66UW1G45G_OCTAL_CFG2_READAW_CMD 0x718eu
#define MX66UW1G45G_OCTAL_READ_STATUS_CMD 0x05fau
#define MX66UW1G45G_OCTAL_WRITE_ENABLE_CMD 0x06f9u
#define MX66UW1G45G_CFG2_DOPI_ADDR       0x00000300u
#define MX66UW1G45G_CFG2_DOPI_VALUE      0x00u
#define MX66UW1G45G_CFG2_DOPI_MASK       0x07u
#define MX66UW1G45G_CFG2_OPI_ADDR        0x00000000u
#define MX66UW1G45G_CFG2_OPI_VALUE       0x02u
#define MX66UW1G45G_CFG2_OPI_MASK        0x02u
#define MX66UW1G45G_OCTAL_READ_CMD       0xee11u
#define MX66UW1G45G_OCTAL_WRITE_CMD      0x12edu
#define MX66UW1G45G_OCTAL_SECTOR_ERASE_CMD 0x21deu
#define MX66UW1G45G_OCTAL_BLOCK_ERASE_CMD 0xdc23u

#define MX66UW1G45G_JEDEC0               0xc2u
#define MX66UW1G45G_JEDEC1               0x81u
#define MX66UW1G45G_JEDEC2               0x3bu
#define MX66UW1G45G_SR_WIP               0x01u
#define MX66UW1G45G_SR_WEL               0x02u
#define MX66UW1G45G_DEVSIZE              26u
#define MX66UW1G45G_SIZE                 STM32N6_XSPI2_NOR_SIZE
#define MX66UW1G45G_PAGE_SIZE            256u
#define MX66UW1G45G_SECTOR_SIZE          0x1000u
#define MX66UW1G45G_BLOCK_SIZE           0x10000u
#define MX66UW1G45G_OCTAL_READ_DUMMY     20u
#define MX66UW1G45G_OCTAL_REG_DUMMY      4u

#define APS256_RESET_CMD                 0xffu
#define APS256_READ_CMD                  0x00u
#define APS256_WRITE_CMD                 0x80u
#define APS256_READ_LINEAR_BURST_CMD     0x20u
#define APS256_WRITE_LINEAR_BURST_CMD    0xa0u
#define APS256_REG_READ_CMD              0x40u
#define APS256_REG_WRITE_CMD             0xc0u

#define APS256_MR0_ADDR                  0x00000000u
#define APS256_MR4_ADDR                  0x00000004u
#define APS256_MR8_ADDR                  0x00000008u
#define APS256_MR0_VALUE                 0x30u
#define APS256_MR4_VALUE                 0x20u
#define APS256_MR8_VALUE                 0x40u
#define APS256_REG_DUMMY                 4u
#define APS256_HEXA_DUMMY                6u
#define APS256_DEVSIZE                   24u
#define APS256_CSBOUND                   11u
#define APS256_FIFO_THRESHOLD            8u
#define APS256_RESET_DELAY_MS            1u

#ifdef CONFIG_ARCH_RAMFUNCS
#  define STM32N6570_RAMFUNC locate_code(".ramfunc") noinline_function
#else
#  define STM32N6570_RAMFUNC
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void stm32n6570_nor_invalidate_cache(uint32_t offset, size_t nbytes)
{
  uintptr_t start = STM32N6_XSPI2_MEM_BASE + offset;

  up_invalidate_dcache(start, start + nbytes);
}

static uint32_t stm32n6570_psram_refresh(uint32_t source_hz,
                                         uint32_t prescaler)
{
  uint32_t xspi_hz = source_hz / (prescaler + 1u);
  uint32_t cycles = 2u * (xspi_hz / 1000000u);

  return cycles > 4u ? cycles - 4u : 0u;
}

static int stm32n6570_nor_readid(uint8_t id[3])
{
  return stm32n6_xspi_read_data(STM32N6_XSPI2_BASE,
                                MX66UW1G45G_READ_ID_CMD, 0,
                                XSPI_CCR_IMODE_1_LINE |
                                XSPI_CCR_DMODE_1_LINE,
                                0, 3, id);
}

static bool stm32n6570_nor_id_blank(FAR const uint8_t id[3])
{
  return (id[0] == 0x00 && id[1] == 0x00 && id[2] == 0x00) ||
         (id[0] == 0xff && id[1] == 0xff && id[2] == 0xff);
}

static void stm32n6570_xspi2_gpio_config(void)
{
  uint32_t pins = (1u << 0) | (1u << 1) | (1u << 2) | (1u << 3) |
                  (1u << 4) | (1u << 5) | (1u << 6) | (1u << 8) |
                  (1u << 9) | (1u << 10) | (1u << 11);

  putreg32(RCC_AHB4ENSR_GPIONENS, STM32N6_RCC_AHB4ENSR);
  (void)getreg32(STM32N6_RCC_AHB4ENR);
  stm32n6_xspi_config_gpio(STM32N6_GPION_BASE, pins, GPIO_AF_XSPIM);
}

static void stm32n6570_xspi1_gpio_config(void)
{
  uint32_t gpioo_pins = (1u << 0) | (1u << 2) | (1u << 3) | (1u << 4);
  uint32_t gpiop_pins = (1u << 0) | (1u << 1) | (1u << 2) | (1u << 3) |
                        (1u << 4) | (1u << 5) | (1u << 6) | (1u << 7) |
                        (1u << 8) | (1u << 9) | (1u << 10) |
                        (1u << 11) | (1u << 12) | (1u << 13) |
                        (1u << 14) | (1u << 15);

  putreg32(RCC_AHB4ENSR_GPIOOENS | RCC_AHB4ENSR_GPIOPENS,
           STM32N6_RCC_AHB4ENSR);
  (void)getreg32(STM32N6_RCC_AHB4ENR);
  stm32n6_xspi_config_gpio(STM32N6_GPIOO_BASE, gpioo_pins,
                           GPIO_AF_XSPIM);
  stm32n6_xspi_config_gpio(STM32N6_GPIOP_BASE, gpiop_pins,
                           GPIO_AF_XSPIM);
}

static void stm32n6570_xspi_enable_clocks(void)
{
  putreg32(RCC_AHB5ENSR_XSPI1ENS | RCC_AHB5ENSR_XSPI2ENS |
           RCC_AHB5ENSR_XSPIMENS, STM32N6_RCC_AHB5ENSR);
  (void)getreg32(STM32N6_RCC_AHB5ENR);
}

