FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
static int stm32n6570_nor_read_cfg2_spi(uint32_t address, uint8_t *value)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_1_LINE | XSPI_CCR_ADMODE_1_LINE |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_1_LINE;

  return stm32n6_xspi_read_data(STM32N6_XSPI2_BASE,
                                MX66UW1G45G_CFG2_READ_CMD, address,
                                ccr, 0, 1, value);
}

static int stm32n6570_nor_read_status_spi(uint8_t *status)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_1_LINE | XSPI_CCR_DMODE_1_LINE;
  return stm32n6_xspi_read_data(STM32N6_XSPI2_BASE,
                                MX66UW1G45G_READ_STATUS_CMD, 0,
                                ccr, 0, 1, status);
}

static STM32N6570_RAMFUNC int stm32n6570_nor_read_status_octal(uint8_t *status)
{
  uint8_t data[2];
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16 |
        XSPI_CCR_ADMODE_8_LINES | XSPI_CCR_ADDTR |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  ret = stm32n6_xspi_read_data(STM32N6_XSPI2_BASE,
                               MX66UW1G45G_OCTAL_READ_STATUS_CMD,
                               0, ccr,
                               XSPI_TCR_DCYC(
                                 MX66UW1G45G_OCTAL_REG_DUMMY),
                               sizeof(data), data);
  if (ret >= 0)
    {
      *status = data[0];
    }

  return ret;
}

static STM32N6570_RAMFUNC int stm32n6570_nor_wait_status(
  int (*read_status)(uint8_t *status), uint8_t mask, uint8_t value)
{
  uint32_t timeout = STM32N6570_XSPI_STATUS_TIMEOUT;
  uint8_t status;
  int ret;

  do
    {
      ret = read_status(&status);
      if (ret < 0)
        {
          return ret;
        }

      if ((status & mask) == value)
        {
          return OK;
        }
    }
  while (timeout-- > 0);

  return -ETIMEDOUT;
}

static int stm32n6570_nor_wait_wip_spi(void)
{
  return stm32n6570_nor_wait_status(stm32n6570_nor_read_status_spi,
                                 MX66UW1G45G_SR_WIP, 0);
}

static STM32N6570_RAMFUNC int stm32n6570_nor_wait_wip_octal(void)
{
  return stm32n6570_nor_wait_status(stm32n6570_nor_read_status_octal,
                                 MX66UW1G45G_SR_WIP, 0);
}

static int stm32n6570_nor_write_enable_spi(void)
{
  int ret;

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_WRITE_ENABLE_CMD,
                             XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      return ret;
    }

  return stm32n6570_nor_wait_status(stm32n6570_nor_read_status_spi,
                                 MX66UW1G45G_SR_WEL,
                                 MX66UW1G45G_SR_WEL);
}

static STM32N6570_RAMFUNC int stm32n6570_nor_write_enable_octal(void)
{
  int ret;

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_OCTAL_WRITE_ENABLE_CMD,
                             XSPI_CCR_IMODE_8_LINES |
                             XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16);
  if (ret < 0)
    {
      return ret;
    }

  return stm32n6570_nor_wait_status(stm32n6570_nor_read_status_octal,
                                 MX66UW1G45G_SR_WEL,
                                 MX66UW1G45G_SR_WEL);
}

static int stm32n6570_nor_write_cfg2_spi(uint32_t address, uint8_t value,
                                      bool wait_after)
{
  uint32_t ccr;
  int ret;

  ret = stm32n6570_nor_wait_wip_spi();
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32n6570_nor_write_enable_spi();
  if (ret < 0)
    {
      return ret;
    }

  ccr = XSPI_CCR_IMODE_1_LINE | XSPI_CCR_ADMODE_1_LINE |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_1_LINE;

  ret = stm32n6_xspi_write_data(STM32N6_XSPI2_BASE,
                                MX66UW1G45G_CFG2_WRITE_CMD, address,
                                ccr, 0, value, 1, false);
  if (ret < 0 || !wait_after)
    {
      return ret;
    }

  return stm32n6570_nor_wait_wip_spi();
}

static int stm32n6570_nor_read_cfg2_octal(uint32_t address, uint8_t *value)
{
  uint8_t data[2];
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16 |
        XSPI_CCR_ADMODE_8_LINES | XSPI_CCR_ADDTR |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  ret = stm32n6_xspi_read_data(STM32N6_XSPI2_BASE,
                               MX66UW1G45G_OCTAL_CFG2_READAW_CMD,
                               address, ccr,
                               XSPI_TCR_DCYC(
                                 MX66UW1G45G_OCTAL_REG_DUMMY),
                               sizeof(data), data);
  if (ret >= 0)
    {
      *value = data[0];
    }

  return ret;
}

static int stm32n6570_nor_config_cfg2_spi(uint32_t address, uint8_t value,
                                       uint8_t mask)
{
  uint8_t readback;
  uint8_t writeval;
  int ret;

  ret = stm32n6570_nor_read_cfg2_spi(address, &readback);
  if (ret < 0)
    {
      return ret;
    }

  writeval = (readback & ~mask) | (value & mask);
  ret = stm32n6570_nor_write_cfg2_spi(address, writeval, true);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32n6570_nor_read_cfg2_spi(address, &readback);
  if (ret < 0)
    {
      return ret;
    }

  if ((readback & mask) != (value & mask))
    {
      syslog(LOG_ERR, "XSPI2 NOR CFG2[0x%08" PRIx32
             "] readback %02x expected %02x\n",
             address, readback, value);
      return -EIO;
    }

  return OK;
}

static STM32N6570_RAMFUNC int stm32n6570_xspi2_enter_memory_mapped(void)
{
  uintptr_t base = STM32N6_XSPI2_BASE;
  uint32_t prescaler = 0;
  uint32_t source_hz;
  uint32_t ccr;
  int ret;

  source_hz = stm32n6_xspi_get_source_hz(base);
  if (source_hz < STM32N6570_XSPI_200MHZ)
    {
      syslog(LOG_WARNING,
             "stm32n6: XSPI2 HSLV disabled, NOR mapped at 50MHz\n");
    }

  ret = stm32n6_xspi_set_prescaler(base, prescaler);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_NXBOOT_BOOTLOADER
  syslog(LOG_INFO, "XSPI2 NOR optional prescaler=%" PRIu32
         " effective=%" PRIu32 "Hz\n", prescaler,
         stm32n6_xspi_effective_hz(source_hz, prescaler));
#else
  UNUSED(source_hz);
#endif

