FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16 |
        XSPI_CCR_ADMODE_8_LINES | XSPI_CCR_ADDTR |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  return stm32n6_xspi_enter_memory_mapped(
           base, ccr, XSPI_TCR_DCYC(MX66UW1G45G_OCTAL_READ_DUMMY),
           MX66UW1G45G_OCTAL_READ_CMD, ccr, 0,
           MX66UW1G45G_OCTAL_WRITE_CMD);
}

static int stm32n6570_xspi1_enter_memory_mapped(void)
{
  uintptr_t base = STM32N6_XSPI1_BASE;
  uint32_t prescaler;
  uint32_t source_hz;
  uint32_t target_hz;
  uint32_t ccr;
  int ret;

  source_hz = stm32n6_xspi_get_source_hz(base);
  target_hz = STM32N6570_XSPI_PSRAM_MAPPED_HZ;
  if (!stm32n6_xspi_hslv_enabled(base) && target_hz > STM32N6570_XSPI_50MHZ)
    {
      syslog(LOG_WARNING,
             "stm32n6: XSPI1 HSLV disabled, PSRAM mapped at 50MHz\n");
      target_hz = STM32N6570_XSPI_50MHZ;
    }

  prescaler = stm32n6_xspi_prescaler(source_hz, target_hz);

  ret = stm32n6_xspi_set_prescaler(base, prescaler);
  if (ret < 0)
    {
      return ret;
    }

  putreg32(stm32n6570_psram_refresh(source_hz, prescaler),
           STM32N6_XSPI_DCR4(base));

  syslog(LOG_INFO, "XSPI1 PSRAM optional prescaler=%" PRIu32
         " effective=%" PRIu32 "Hz refresh=%" PRIu32 "\n",
         prescaler, stm32n6_xspi_effective_hz(source_hz, prescaler),
         getreg32(STM32N6_XSPI_DCR4(base)));

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_16_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  return stm32n6_xspi_enter_memory_mapped(
           base, ccr, XSPI_TCR_DCYC(APS256_HEXA_DUMMY),
           APS256_READ_LINEAR_BURST_CMD,
           ccr, XSPI_TCR_DCYC(APS256_HEXA_DUMMY),
           APS256_WRITE_LINEAR_BURST_CMD);
}

static int stm32n6570_psram_write_reg(uint32_t address, uint8_t value)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  return stm32n6_xspi_write_data(STM32N6_XSPI1_BASE,
                                 APS256_REG_WRITE_CMD, address, ccr,
                                 0, value, 2, true);
}

static int stm32n6570_psram_read_reg(uint32_t address, uint8_t *value)
{
  uint8_t data[2];
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  ret = stm32n6_xspi_read_data(STM32N6_XSPI1_BASE,
                               APS256_REG_READ_CMD, address, ccr,
                               XSPI_TCR_DCYC(APS256_REG_DUMMY),
                               sizeof(data), data);
  if (ret >= 0)
    {
      *value = data[0];
    }

  return ret;
}

static int stm32n6570_psram_config_reg(uint32_t address, uint8_t value,
                                    uint8_t mask)
{
  uint8_t initial;
  uint8_t readback;
  uint8_t writeval;
  int ret;

  ret = stm32n6570_psram_read_reg(address, &initial);
  if (ret < 0)
    {
      return ret;
    }

  writeval = (initial & ~mask) | (value & mask);
  ret = stm32n6570_psram_write_reg(address, writeval);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32n6570_psram_read_reg(address, &readback);
  if (ret < 0)
    {
      return ret;
    }

  if ((readback & mask) != (value & mask))
    {
      ferr("ERROR: PSRAM reg 0x%08" PRIx32 " readback %02x expected %02x\n",
           address, readback, value);
      syslog(LOG_ERR, "XSPI1 PSRAM MR%08" PRIx32
             " initial %02x write %02x readback %02x expected %02x\n",
             address, initial, writeval, readback, value);
      return -EIO;
    }

  syslog(LOG_INFO, "XSPI1 PSRAM MR%08" PRIx32
         " initial %02x write %02x readback %02x\n",
         address, initial, writeval, readback);
  return OK;
}

static void stm32n6570_psram_dcache_flush(FAR const volatile void *addr,
                                          size_t size)
{
  uintptr_t start = (uintptr_t)addr;
  uintptr_t end = start + size;

  up_flush_dcache(start, end);
  up_invalidate_dcache(start, end);
}

static int stm32n6570_psram_selftest(void)
{
  volatile uint32_t *mem = (volatile uint32_t *)STM32N6_XSPI1_MEM_BASE;
  const uint32_t offsets[] =
    {
      0x00000000u,
      0x00000040u,
      0x00001000u,
      0x00001040u,
      0x00100000u,
      0x00ffffc0u,
      0x01ffffc0u,
      STM32N6_XSPI1_PSRAM_SIZE - 0x20u
    };

  const uint32_t alias_offsets[] =
    {
      0x00000000u,
      0x00000040u,
      0x000000c0u,
      0x00000100u,
      0x00000140u,
      0x000001c0u,
      0x00000200u,
      0x000002c0u
    };

  uint32_t saved[8];
  uint32_t alias_saved[sizeof(alias_offsets) / sizeof(alias_offsets[0])];
  uint32_t pattern[8] =
    {
      0x55aa55aau, 0xaa55aa55u, 0x01234567u, 0x89abcdefu,
      0xf0f00f0fu, 0x0f0ff0f0u, 0x13579bdfu, 0x2468ace0u
    };
  size_t alias;
  size_t region;
  size_t restore;
  int i;

  for (region = 0; region < nitems(offsets); region++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + offsets[region]);

      for (i = 0; i < 8; i++)
        {
          saved[i] = ptr[i];
        }

      for (i = 0; i < 8; i++)
        {
          ptr[i] = pattern[i];
        }

      stm32n6570_psram_dcache_flush(ptr, sizeof(pattern));

      for (i = 0; i < 8; i++)
        {
          if (ptr[i] != pattern[i])
            {
              ferr("ERROR: PSRAM self-test[0x%08" PRIx32 "+%d] got %08"
                   PRIx32 " expected %08" PRIx32 "\n",
                   offsets[region], i * 4, ptr[i], pattern[i]);
              for (i = 0; i < 8; i++)
                {
                  ptr[i] = saved[i];
                }

              stm32n6570_psram_dcache_flush(ptr, sizeof(saved));
              return -EIO;
            }
        }

      for (i = 0; i < 8; i++)
        {
          ptr[i] = saved[i];
        }

