FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
      stm32n6570_psram_dcache_flush(ptr, sizeof(saved));
    }

  for (alias = 0; alias < nitems(alias_offsets); alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);

      alias_saved[alias] = *ptr;
      *ptr = STM32N6_XSPI1_MEM_BASE + alias_offsets[alias];
    }

  stm32n6570_psram_dcache_flush(mem, 0x300);

  for (alias = 0; alias < nitems(alias_offsets); alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);
      uint32_t expected = STM32N6_XSPI1_MEM_BASE + alias_offsets[alias];

      if (*ptr != expected)
        {
          ferr("ERROR: PSRAM address self-test[0x%08" PRIx32
               "] got %08" PRIx32 " expected %08" PRIx32 "\n",
               alias_offsets[alias], *ptr, expected);
          for (restore = 0; restore < nitems(alias_offsets); restore++)
            {
              ptr = (volatile uint32_t *)((uintptr_t)mem +
                                          alias_offsets[restore]);
              *ptr = alias_saved[restore];
            }

          stm32n6570_psram_dcache_flush(mem, 0x300);
          return -EIO;
        }
    }

  for (alias = 0; alias < nitems(alias_offsets); alias++)
    {
      volatile uint32_t *ptr =
        (volatile uint32_t *)((uintptr_t)mem + alias_offsets[alias]);

      *ptr = alias_saved[alias];
    }

  stm32n6570_psram_dcache_flush(mem, 0x300);

  syslog(LOG_INFO, "XSPI1 PSRAM self-test passed\n");
  return OK;
}

static STM32N6570_RAMFUNC uint32_t stm32n6570_nor_octal_command_ccr(void)
{
  return XSPI_CCR_IMODE_8_LINES | XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16 |
         XSPI_CCR_ADMODE_8_LINES | XSPI_CCR_ADDTR |
         XSPI_CCR_ADSIZE_32;
}

static STM32N6570_RAMFUNC uint32_t stm32n6570_nor_octal_data_ccr(void)
{
  return stm32n6570_nor_octal_command_ccr() |
         XSPI_CCR_DMODE_8_LINES | XSPI_CCR_DDTR | XSPI_CCR_DQSE;
}

static void stm32n6570_nor_log_error(FAR const char *op, int ret)
{
  uint8_t status = 0xff;

  (void)stm32n6570_nor_read_status_octal(&status);
  syslog(LOG_ERR, "XSPI2 NOR %s failed: %d sr=%02x xspi_sr=%08" PRIx32
         " cr=%08" PRIx32 "\n",
         op, ret, status,
         getreg32(STM32N6_XSPI_SR(STM32N6_XSPI2_BASE)),
         getreg32(STM32N6_XSPI_CR(STM32N6_XSPI2_BASE)));
}

static STM32N6570_RAMFUNC int stm32n6570_nor_restore_memory_mapped(int opret)
{
  int mapret;

  mapret = stm32n6570_xspi2_enter_memory_mapped();
  if (mapret < 0)
    {
#ifdef CONFIG_NXBOOT_BOOTLOADER
      syslog(LOG_ERR, "XSPI2 NOR restore memory-map failed: %d\n", mapret);
#endif
      return opret < 0 ? opret : mapret;
    }

  return opret;
}

static STM32N6570_RAMFUNC int stm32n6570_nor_finish_error(FAR const char *op,
                                                    int opret)
{
  int mapret;

  mapret = stm32n6570_xspi2_enter_memory_mapped();
  if (mapret >= 0)
    {
      stm32n6570_nor_log_error(op, opret);
    }

  return opret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32n6570_xspi2_nor_initialize(void)
{
  struct stm32n6_xspi_config_s nor_config;
  uint32_t startup_prescaler;
  uint32_t source_hz;
  uint8_t cfg2;
  uint32_t header;
  uint8_t id[3] = {0};
  int ret;

  syslog(LOG_INFO, "XSPI2 NOR init begin\n");

  stm32n6570_xspi_enable_clocks();

  if (stm32n6_xspi_is_mapped(STM32N6_XSPI2_BASE))
    {
      syslog(LOG_INFO, "XSPI2 NOR already memory-mapped\n");
      return OK;
    }

  ret = stm32n6_xspi_common_setup();
  if (ret < 0)
    {
      ferr("ERROR: XSPI common setup failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR common setup failed: %d\n", ret);
      return ret;
    }

  source_hz = stm32n6_xspi_get_source_hz(STM32N6_XSPI2_BASE);
  startup_prescaler =
    stm32n6_xspi_prescaler(source_hz, STM32N6570_XSPI_50MHZ);

  syslog(LOG_INFO, "XSPI2 NOR startup prescaler=%" PRIu32
         " effective=%" PRIu32 "Hz\n", startup_prescaler,
         stm32n6_xspi_effective_hz(source_hz, startup_prescaler));

  stm32n6570_xspi2_gpio_config();

  nor_config.base           = STM32N6_XSPI2_BASE;
  nor_config.reset          = RCC_AHB5RSTR_XSPI2RST;
  nor_config.memory_type    = XSPI_DCR1_MTYP_MACRONIX;
  nor_config.device_size    = MX66UW1G45G_DEVSIZE;
  nor_config.csht           = 2;
  nor_config.prescaler      = startup_prescaler;
  nor_config.fifo_threshold = 4;
  nor_config.csbound        = 0;
  nor_config.refresh        = 0;
  stm32n6_xspi_controller_config(&nor_config);

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_OCTA_RESET_ENABLE_CMD,
                             XSPI_CCR_IMODE_8_LINES |
                             XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "XSPI2 NOR octal reset-enable failed: %d\n",
             ret);
    }

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_OCTA_RESET_MEMORY_CMD,
                             XSPI_CCR_IMODE_8_LINES |
                             XSPI_CCR_IDTR | XSPI_CCR_ISIZE_16);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "XSPI2 NOR octal reset failed: %d\n", ret);
    }

  up_mdelay(STM32N6570_XSPI_NOR_RESET_DELAY_MS);

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_RESET_ENABLE_CMD,
                             XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR reset-enable failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR reset-enable failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6_xspi_command(STM32N6_XSPI2_BASE,
                             MX66UW1G45G_RESET_MEMORY_CMD,
                             XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR reset failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR reset failed: %d\n", ret);
      return ret;
    }

  up_mdelay(STM32N6570_XSPI_NOR_RESET_DELAY_MS);

  ret = stm32n6570_nor_readid(id);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR read-id failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR read-id failed: %d sr=%08" PRIx32 "\n",
             ret, getreg32(STM32N6_XSPI_SR(STM32N6_XSPI2_BASE)));
      return ret;
    }

