FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
  syslog(LOG_INFO, "XSPI2 NOR JEDEC ID %02x %02x %02x\n",
         id[0], id[1], id[2]);
  if (stm32n6570_nor_id_blank(id))
    {
      ferr("ERROR: XSPI2 NOR JEDEC ID is blank\n");
      syslog(LOG_ERR, "XSPI2 NOR JEDEC ID is blank\n");
      syslog(LOG_ERR, "XSPI2 regs CR=%08" PRIx32 " SR=%08" PRIx32
             " DCR1=%08" PRIx32 " DCR2=%08" PRIx32
             " CCR=%08" PRIx32 " TCR=%08" PRIx32
             " DLR=%08" PRIx32 "\n",
             getreg32(STM32N6_XSPI_CR(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_SR(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_DCR1(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_DCR2(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_CCR(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_TCR(STM32N6_XSPI2_BASE)),
             getreg32(STM32N6_XSPI_DLR(STM32N6_XSPI2_BASE)));
      return -EIO;
    }

  ret = stm32n6570_nor_config_cfg2_spi(MX66UW1G45G_CFG2_DOPI_ADDR,
                                    MX66UW1G45G_CFG2_DOPI_VALUE,
                                    MX66UW1G45G_CFG2_DOPI_MASK);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR DOPI config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR DOPI config failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_nor_read_cfg2_spi(MX66UW1G45G_CFG2_OPI_ADDR, &cfg2);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR OPI config read failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR OPI config read failed: %d\n", ret);
      return ret;
    }

  cfg2 = (cfg2 & ~MX66UW1G45G_CFG2_OPI_MASK) |
         (MX66UW1G45G_CFG2_OPI_VALUE & MX66UW1G45G_CFG2_OPI_MASK);
  ret = stm32n6570_nor_write_cfg2_spi(MX66UW1G45G_CFG2_OPI_ADDR, cfg2,
                                   false);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR OPI config write failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR OPI config write failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6_xspi_set_prescaler(STM32N6_XSPI2_BASE, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32n6570_nor_wait_wip_octal();
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR optional WIP wait failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR optional WIP wait failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_nor_read_cfg2_octal(MX66UW1G45G_CFG2_OPI_ADDR, &cfg2);
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR optional read-after-write failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR optional read-after-write failed: %d\n",
             ret);
      return ret;
    }

  if ((cfg2 & MX66UW1G45G_CFG2_OPI_MASK) != MX66UW1G45G_CFG2_OPI_VALUE)
    {
      ferr("ERROR: XSPI2 NOR OPI readback %02x expected %02x\n",
           cfg2, MX66UW1G45G_CFG2_OPI_VALUE);
      syslog(LOG_ERR, "XSPI2 NOR OPI readback %02x expected %02x\n",
             cfg2, MX66UW1G45G_CFG2_OPI_VALUE);
      return -EIO;
    }

  syslog(LOG_INFO, "XSPI2 NOR OPI/DTR config readback %02x\n", cfg2);

  ret = stm32n6570_xspi2_enter_memory_mapped();
  if (ret < 0)
    {
      ferr("ERROR: XSPI2 NOR memory-map failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI2 NOR memory-map failed: %d\n", ret);
      return ret;
    }

  header = *(volatile uint32_t *)(STM32N6_XSPI2_MEM_BASE +
                                  CONFIG_STM32N6_OTA_PRIMARY_SLOT_OFFSET);
  syslog(LOG_INFO, "XSPI2 NOR mapped 0x%08x ota0[0]=0x%08" PRIx32 "\n",
         STM32N6_XSPI2_MEM_BASE, header);
  return OK;
}

STM32N6570_RAMFUNC int stm32n6570_xspi2_nor_erase(uint32_t offset,
                                            size_t nbytes)
{
  uint32_t start_offset = offset;
  size_t erase_nbytes = nbytes;
  uint32_t ccr;
  int ret;

  if (nbytes == 0)
    {
      return OK;
    }

  if ((offset % MX66UW1G45G_SECTOR_SIZE) != 0 ||
      (nbytes % MX66UW1G45G_SECTOR_SIZE) != 0 ||
      offset > MX66UW1G45G_SIZE ||
      nbytes > MX66UW1G45G_SIZE - offset)
    {
      return -EINVAL;
    }

  ret = stm32n6_xspi_common_setup();
  if (ret < 0)
    {
      return ret;
    }

  if (!stm32n6_xspi_is_mapped(STM32N6_XSPI2_BASE))
    {
      ret = stm32n6570_xspi2_nor_initialize();
      if (ret < 0)
        {
          return ret;
        }
    }

  ret = stm32n6_xspi_abort_memory_mapped(STM32N6_XSPI2_BASE);
  if (ret < 0)
    {
      return stm32n6570_nor_finish_error("abort", ret);
    }

  ccr = stm32n6570_nor_octal_command_ccr();
  while (nbytes > 0)
    {
      uint32_t cmd;
      size_t erasesize;

      if ((offset % MX66UW1G45G_BLOCK_SIZE) == 0 &&
          nbytes >= MX66UW1G45G_BLOCK_SIZE)
        {
          cmd = MX66UW1G45G_OCTAL_BLOCK_ERASE_CMD;
          erasesize = MX66UW1G45G_BLOCK_SIZE;
        }
      else
        {
          cmd = MX66UW1G45G_OCTAL_SECTOR_ERASE_CMD;
          erasesize = MX66UW1G45G_SECTOR_SIZE;
        }

      ret = stm32n6570_nor_write_enable_octal();
      if (ret < 0)
        {
          return stm32n6570_nor_finish_error("write-enable erase", ret);
        }

      ret = stm32n6_xspi_command_addr(STM32N6_XSPI2_BASE, cmd, offset,
                                      ccr, 0);
      if (ret < 0)
        {
          return stm32n6570_nor_finish_error("erase command", ret);
        }

      ret = stm32n6570_nor_wait_wip_octal();
      if (ret < 0)
        {
          return stm32n6570_nor_finish_error("erase wait", ret);
        }

      offset += erasesize;
      nbytes -= erasesize;
    }

  ret = stm32n6570_nor_restore_memory_mapped(OK);
  if (ret < 0)
    {
      return ret;
    }

  stm32n6570_nor_invalidate_cache(start_offset, erase_nbytes);
  return OK;
}

STM32N6570_RAMFUNC ssize_t stm32n6570_xspi2_nor_write(
  uint32_t offset, FAR const uint8_t *buffer, size_t nbytes)
{
  uint32_t start_offset = offset;
  size_t written = 0;
  uint32_t ccr;
  int ret;

  if (nbytes == 0)
    {
      return 0;
    }

  if (buffer == NULL || offset > MX66UW1G45G_SIZE ||
      nbytes > MX66UW1G45G_SIZE - offset)
    {
      return -EINVAL;
    }

  ret = stm32n6_xspi_common_setup();
  if (ret < 0)
    {
      return ret;
    }

