FeatherCore/nuttx/boards/arm/stm32n6/stm32n6570-dk/src/stm32n6570_xspi.c
  if (!stm32n6_xspi_is_mapped(STM32N6_XSPI2_BASE))
    {
      ret = stm32n6570_xspi2_nor_initialize();
      if (ret < 0)
        {
          return ret;
        }
    }

  ret = stm32n6_xspi_abort_memory_mapped(STM32N6_XSPI2_BASE);
  if (ret < 0)
    {
      return stm32n6570_nor_finish_error("abort", ret);
    }

  ccr = stm32n6570_nor_octal_data_ccr();
  while (written < nbytes)
    {
      size_t pageleft = MX66UW1G45G_PAGE_SIZE -
                        ((offset + written) % MX66UW1G45G_PAGE_SIZE);
      size_t chunk = nbytes - written;

      if (chunk > pageleft)
        {
          chunk = pageleft;
        }

      ret = stm32n6570_nor_write_enable_octal();
      if (ret < 0)
        {
          (void)stm32n6570_nor_finish_error("write-enable program", ret);
          return written > 0 ? (ssize_t)written : ret;
        }

      ret = stm32n6_xspi_write_buffer(STM32N6_XSPI2_BASE,
                                      MX66UW1G45G_OCTAL_WRITE_CMD,
                                      offset + written, ccr, 0,
                                      buffer + written, chunk);
      if (ret < 0)
        {
          (void)stm32n6570_nor_finish_error("page program", ret);
          return written > 0 ? (ssize_t)written : ret;
        }

      ret = stm32n6570_nor_wait_wip_octal();
      if (ret < 0)
        {
          (void)stm32n6570_nor_finish_error("program wait", ret);
          return written > 0 ? (ssize_t)written : ret;
        }

      written += chunk;
    }

  ret = stm32n6570_nor_restore_memory_mapped(OK);
  if (ret < 0)
    {
      return ret;
    }

  stm32n6570_nor_invalidate_cache(start_offset, written);
  return (ssize_t)written;
}

int stm32n6570_xspi1_psram_initialize(void)
{
  struct stm32n6_xspi_config_s psram_config;
  uint32_t startup_prescaler;
  uint32_t source_hz;
  int ret;

  syslog(LOG_INFO, "XSPI1 PSRAM init begin\n");

  stm32n6570_xspi_enable_clocks();

  if (stm32n6_xspi_is_mapped(STM32N6_XSPI1_BASE))
    {
      syslog(LOG_INFO, "XSPI1 PSRAM already memory-mapped\n");
      return stm32n6570_psram_selftest();
    }

  ret = stm32n6_xspi_common_setup();
  if (ret < 0)
    {
      ferr("ERROR: XSPI common setup failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM common setup failed: %d\n", ret);
      return ret;
    }

  source_hz = stm32n6_xspi_get_source_hz(STM32N6_XSPI1_BASE);
  startup_prescaler =
    stm32n6_xspi_prescaler(source_hz, STM32N6570_XSPI_50MHZ);

  syslog(LOG_INFO, "XSPI1 PSRAM startup prescaler=%" PRIu32
         " effective=%" PRIu32 "Hz refresh=%" PRIu32 "\n",
         startup_prescaler,
         stm32n6_xspi_effective_hz(source_hz, startup_prescaler),
         stm32n6570_psram_refresh(source_hz, startup_prescaler));

  stm32n6570_xspi1_gpio_config();

  psram_config.base           = STM32N6_XSPI1_BASE;
  psram_config.reset          = RCC_AHB5RSTR_XSPI1RST;
  psram_config.memory_type    = XSPI_DCR1_MTYP_APMEM_16BIT;
  psram_config.device_size    = APS256_DEVSIZE;
  psram_config.csht           = 5;
  psram_config.prescaler      = startup_prescaler;
  psram_config.fifo_threshold = APS256_FIFO_THRESHOLD;
  psram_config.csbound        = APS256_CSBOUND;
  psram_config.refresh        =
    stm32n6570_psram_refresh(source_hz, startup_prescaler);
  stm32n6_xspi_controller_config(&psram_config);

  ret = stm32n6_xspi_command_addr(STM32N6_XSPI1_BASE,
                                  APS256_RESET_CMD, 0,
                                  XSPI_CCR_IMODE_8_LINES |
                                  XSPI_CCR_ADMODE_8_LINES |
                                  XSPI_CCR_ADSIZE_32,
                                  0);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM reset failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM reset failed: %d\n", ret);
      return ret;
    }

  up_mdelay(APS256_RESET_DELAY_MS);

  ret = stm32n6570_psram_config_reg(APS256_MR0_ADDR, APS256_MR0_VALUE, 0x3f);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR0 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR0 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_psram_config_reg(APS256_MR4_ADDR, APS256_MR4_VALUE, 0xe0);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR4 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR4 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_psram_config_reg(APS256_MR8_ADDR, APS256_MR8_VALUE, 0x40);
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM MR8 config failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM MR8 config failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_xspi1_enter_memory_mapped();
  if (ret < 0)
    {
      ferr("ERROR: XSPI1 PSRAM memory-map failed: %d\n", ret);
      syslog(LOG_ERR, "XSPI1 PSRAM memory-map failed: %d\n", ret);
      return ret;
    }

  ret = stm32n6570_psram_selftest();
  if (ret < 0)
    {
      return ret;
    }

  syslog(LOG_INFO, "XSPI1 PSRAM mapped at 0x%08x\n",
         STM32N6_XSPI1_MEM_BASE);
  return OK;
}
